import { Injectable } from '@angular/core';
import { reviews } from '../../../types/reviews';

@Injectable()
export class ReviewService {

  private reviewStore: {
    [revId: string]: reviews.db.Review
  }  = {
    'review1': {
      id: 'review1',
      author_name: 'Софія Мельничук',
      text: `Мені подобається відвідувати курси англійської та німецької мов у клубі "KIDS". Я думаю, що інформація, яку подають тут вчителі доступна для сприйняття і має своє практичне застосування. Мені подобається також, як Катерина Володимирівна урізноманітнює наші уроки, тим самим заохочуючи вивчати іноземні мови. Я бажаю, щоб ви продовжували в такому ж дусі.`
    },
    'review2': {
      id: 'review2',
      author_name: 'Вікторія Чистякова',
      text: `Ще в дитячому садочку я полюбила англійську мову. Мої батьки вирішили віддати мене на навчання в "KIDS". Мені сподобалось і я продовжила вчитися. Я вчусь вже сьомий рік і в мене ще не зник інтерес. Мій викладач, Катерина Володимирівна, зрозуміло  й доступно пояснює мені й моїм одногрупникам матеріал. Не знаю, як кому, але мені все зрозуміло. В навчанні ми використовуємо різні методи вивчення слів та інформації. Мені подобається її стриманість, коли потрібно вона завжди допоможе, пояснить незрозуміле. Я хочу взяти з неї приклад і в майбутньому піти на викладача англійської мови.`
    },
    'review3': {
      id: 'review3',
      author_name: 'Марія Сугай',
      text: `Кожному з нас у цьому світі потрібна англійська мова. Адже це міжнародна мова. Вона стане в нагоді кожному, в будь-якій професії, в житті за кордоном, чи просто в саморозвитку. Я ходжу в "KIDS" змалечку і всім задоволена. Адже тут ви зможете вивчити англійську мову, і це вивчення буде тільки в задоволення. Особливо, якщо вивчати англійську мову у групах, адже ви також навчитесь бути більш відкритими, комунікабельними, і ще й знайдете нових друзів. Але кому не підходить навчання у групах, є ще індивідуальні заняття. Звичайно, вивчаючи мову, кожному потрібен вчитель, і у мене - це Катерина Володимирівна. Я пишаюсь, що особливо вона навчає мене. Наша вчителька більш ніж вчитель, вона нам, як друг. Адже це людина, яка знайде підхід до кожного, а також не пару разів пояснить матеріал тяжкому учневі. Коли в тебе немає настрою - завжди підніме його. За ці чотири роки я не мало навчилася, і  це все заслуга найкращого вчителя - Катерини Володимирівни.`
    }
  }

  constructor() { }

  public getReviews(): Promise<reviews.Review[]> {
    return new Promise((resolve, reject) => {
        const revs = Object.keys(this.reviewStore)
          .map(revId => this.reviewStore[revId])
          .map(revDb => new reviews.Review(revDb, 160));
        resolve(revs);
    });
  }

}
